Revit 2027 API
AnalysisDisplayStyle.SetColorSettings Method
 Set color settings object for the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetColorSettings(
	AnalysisDisplayColorSettings colorSettings
)
Public Sub SetColorSettings (
	colorSettings As AnalysisDisplayColorSettings
)
public:
void SetColorSettings(
	AnalysisDisplayColorSettings^ colorSettings
)
member SetColorSettings :
        colorSettings : AnalysisDisplayColorSettings -> unit
Parameters
colorSettings AnalysisDisplayColorSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentsInconsistentException |  for Diagram display style, colorSettings must have type SolidColorRanges and exactly one intermediate entry with zero value
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace